const days = ["일", "월", "화", "수", "목", "금", "토"];

//오늘 날짜 기준으로 7일을 불러오는 result에 배열로 담아주는 함수
const getNext7Days = () => {
  const result = [];
  const today = new Date();

  for (let i = 0; i < 7; i++) {
    const date = new Date(today);
    date.setDate(today.getDate() + i);

    result.push({
      fullDate: date.toISOString().split("T")[0],
      label: `${date.getMonth() + 1}/${date.getDate()} (${
        days[date.getDay()]
      })`,
    });
  }
  return result;
};

const dates = getNext7Days();

var movie = [
  {
    duedate: dates[0].label,
    movieName: [
      {
        title: "극장판 귀멸의 칼날: 무한성편",
        theaters: [
          { name: "1관", times: ["09:00", "12:00", "15:00", "18:00"] },
          { name: "2관", times: ["10:30", "13:30", "16:30", "19:30"] },
          { name: "3관", times: ["11:00", "14:00", "17:00", "20:00"] },
        ],
      },
      {
        title: "F1 더 무비",
        theaters: [
          { name: "1관", times: ["08:30", "11:30", "14:30", "17:30"] },
          { name: "2관", times: ["10:00", "13:00", "16:00", "19:00"] },
        ],
      },
      {
        title: "좀비딸",
        theaters: [
          { name: "1관", times: ["10:00", "13:00", "16:00"] },
          { name: "2관", times: ["11:30", "14:30", "17:30"] },
          { name: "3관", times: ["13:00", "16:00", "19:00"] },
        ],
      },
      {
        title: "퓨리오사: 매드맥스 사가",
        theaters: [
          { name: "1관", times: ["10:00", "14:00", "18:00"] },
          { name: "2관", times: ["11:00", "15:00", "19:00"] },
        ],
      },
      {
        title: "인사이드 아웃 2",
        theaters: [
          { name: "1관", times: ["10:00", "13:00", "16:00"] },
          { name: "2관", times: ["11:30", "14:30", "17:30"] },
          { name: "3관", times: ["13:00", "16:00", "19:00"] },
        ],
      },
      {
        title: "하이재킹",
        theaters: [
          { name: "1관", times: ["09:00", "12:00", "15:00"] },
          { name: "2관", times: ["10:30", "13:30", "16:30"] },
        ],
      },
    ],
  },
  {
    duedate: dates[1].label,
    movieName: [
      {
        title: "좀비딸",
        theaters: [
          { name: "1관", times: ["09:30", "12:30", "15:30", "18:30"] },
          { name: "2관", times: ["10:00", "13:00", "16:00", "19:00"] },
          { name: "3관", times: ["11:00", "14:00", "17:00", "20:00"] },
        ],
      },
      {
        title: "F1 더 무비",
        theaters: [
          { name: "1관", times: ["09:00", "12:00", "15:00", "18:00"] },
          { name: "2관", times: ["10:30", "13:30", "16:30", "19:30"] },
          { name: "3관", times: ["11:00", "14:00", "17:00", "20:00"] },
        ],
      },
      {
        title: "극장판 귀멸의 칼날: 무한성편",
        theaters: [{ name: "1관", times: ["09:00", "12:00", "15:00"] }],
      },
      {
        title: "하이재킹",
        theaters: [
          { name: "1관", times: ["09:00", "12:00", "15:00", "18:00"] },
          { name: "2관", times: ["10:30", "13:30", "16:30"] },
          { name: "3관", times: ["11:00", "14:00", "17:00", "20:00"] },
          { name: "4관", times: ["13:00", "16:00", "19:00"] },
        ],
      },
      {
        title: "범죄도시 4",
        theaters: [
          { name: "1관", times: ["10:00", "13:00", "16:00"] },
          { name: "2관", times: ["11:30", "14:30", "17:30"] },
        ],
      },
    ],
  },
  {
    duedate: dates[2].label,
    movieName: [
      {
        title: "F1 더 무비",
        theaters: [
          { name: "1관", times: ["09:00", "12:00", "15:00", "18:00"] },
          { name: "2관", times: ["10:00", "13:00", "16:00", "19:00"] },
          { name: "3관", times: ["11:00", "14:00", "17:00", "20:00"] },
        ],
      },
      {
        title: "극장판 귀멸의 칼날: 무한성편",
        theaters: [
          { name: "1관", times: ["09:00", "12:00", "15:00", "18:00"] },
          { name: "2관", times: ["10:30", "13:30", "16:30", "19:30"] },
        ],
      },
      {
        title: "좀비딸",
        theaters: [
          { name: "1관", times: ["09:30", "12:30", "15:30", "18:30"] },
          { name: "2관", times: ["11:00", "14:00", "17:00", "20:00"] },
        ],
      },
      {
        title: "데드풀과 울버린",
        theaters: [
          { name: "1관", times: ["10:00", "13:00", "16:00", "19:00"] },
          { name: "2관", times: ["11:30", "14:30", "17:30", "20:30"] },
          { name: "3관", times: ["12:00", "15:00", "18:00", "21:00"] },
        ],
      },
      {
        title: "인사이드 아웃 2",
        theaters: [
          { name: "1관", times: ["10:00", "13:00", "16:00"] },
          { name: "2관", times: ["11:30", "14:30", "17:30"] },
        ],
      },
      {
        title: "원더랜드",
        theaters: [
          { name: "1관", times: ["09:00", "12:00", "15:00"] },
          { name: "2관", times: ["10:00", "13:00", "16:00"] },
        ],
      },
    ],
  },
  {
    duedate: dates[3].label,
    movieName: [
      {
        title: "좀비딸",
        theaters: [
          { name: "1관", times: ["09:00", "12:00", "15:00", "18:00"] },
          { name: "2관", times: ["10:30", "13:30", "16:30", "19:30"] },
          { name: "3관", times: ["11:00", "14:00", "17:00", "20:00"] },
        ],
      },
      {
        title: "F1 더 무비",
        theaters: [
          { name: "1관", times: ["08:30", "11:30", "14:30"] },
          { name: "2관", times: ["10:00", "13:00", "16:00"] },
        ],
      },
      {
        title: "극장판 귀멸의 칼날: 무한성편",
        theaters: [
          { name: "1관", times: ["09:30", "12:30", "15:30", "18:30"] },
          { name: "2관", times: ["11:00", "14:00", "17:00", "20:00"] },
        ],
      },
      {
        title: "하이재킹",
        theaters: [
          { name: "1관", times: ["10:00", "13:00", "16:00"] },
          { name: "2관", times: ["11:30", "14:30", "17:30"] },
        ],
      },
      {
        title: "인사이드 아웃 2",
        theaters: [
          { name: "1관", times: ["09:00", "12:00", "15:00"] },
          { name: "2관", times: ["10:00", "13:00", "16:00"] },
        ],
      },
      {
        title: "원더랜드",
        theaters: [{ name: "1관", times: ["09:30", "12:30", "15:30"] }],
      },
    ],
  },
  {
    duedate: dates[4].label,
    movieName: [
      {
        title: "F1 더 무비",
        theaters: [
          { name: "1관", times: ["09:00", "12:00", "15:00", "18:00"] },
          { name: "2관", times: ["10:30", "13:30", "16:30", "19:30"] },
          { name: "3관", times: ["11:00", "14:00", "17:00", "20:00"] },
        ],
      },
      {
        title: "좀비딸",
        theaters: [
          { name: "1관", times: ["09:00", "12:00", "15:00"] },
          { name: "2관", times: ["10:30", "13:30", "16:30"] },
        ],
      },
      {
        title: "극장판 귀멸의 칼날: 무한성편",
        theaters: [
          { name: "1관", times: ["09:30", "12:30", "15:30", "18:30"] },
          { name: "2관", times: ["11:00", "14:00", "17:00", "20:00"] },
        ],
      },
      {
        title: "인사이드 아웃 2",
        theaters: [
          { name: "1관", times: ["10:00", "13:00", "16:00"] },
          { name: "2관", times: ["11:30", "14:30", "17:30"] },
        ],
      },
      {
        title: "하이재킹",
        theaters: [
          { name: "1관", times: ["10:00", "13:00", "16:00"] },
          { name: "2관", times: ["11:30", "14:30", "17:30"] },
        ],
      },
      {
        title: "설계자",
        theaters: [
          { name: "1관", times: ["09:00", "12:00", "15:00"] },
          { name: "2관", times: ["10:00", "13:00", "16:00"] },
        ],
      },
      {
        title: "데드풀과 울버린",
        theaters: [{ name: "1관", times: ["09:30", "12:30", "15:30"] }],
      },
    ],
  },
  {
    duedate: dates[5].label,
    movieName: [
      {
        title: "극장판 귀멸의 칼날: 무한성편",
        theaters: [
          { name: "1관", times: ["09:00", "12:00", "15:00", "18:00"] },
          { name: "2관", times: ["10:30", "13:30", "16:30", "19:30"] },
          { name: "3관", times: ["11:00", "14:00", "17:00", "20:00"] },
          { name: "4관", times: ["12:00", "15:00", "18:00", "21:00"] },
          { name: "5관", times: ["13:00", "16:00", "19:00", "22:00"] },
        ],
      },
      {
        title: "F1 더 무비",
        theaters: [
          { name: "1관", times: ["08:30", "11:30", "14:30", "17:30"] },
          { name: "2관", times: ["10:00", "13:00", "16:00", "19:00"] },
        ],
      },
      {
        title: "좀비딸",
        theaters: [{ name: "1관", times: ["09:00", "12:00", "15:00"] }],
      },
      {
        title: "파일럿",
        theaters: [
          { name: "1관", times: ["09:30", "12:30", "15:30", "18:30"] },
          { name: "2관", times: ["11:00", "14:00", "17:00", "20:00"] },
        ],
      },
      {
        title: "데드풀과 울버린",
        theaters: [{ name: "1관", times: ["10:00", "13:00", "16:00"] }],
      },
      {
        title: "하이재킹",
        theaters: [{ name: "1관", times: ["09:00", "12:00", "15:00"] }],
      },
    ],
  },
  {
    duedate: dates[6].label,
    movieName: [
      {
        title: "좀비딸",
        theaters: [
          { name: "1관", times: ["09:00", "12:00", "15:00"] },
          { name: "2관", times: ["10:00", "13:00", "16:00"] },
          { name: "3관", times: ["11:00", "14:00", "17:00"] },
        ],
      },
      {
        title: "극장판 귀멸의 칼날: 무한성편",
        theaters: [
          { name: "1관", times: ["08:30", "11:30", "14:30"] },
          { name: "2관", times: ["09:30", "12:30", "15:30"] },
          { name: "3관", times: ["13:00", "16:00", "19:00"] },
        ],
      },
      {
        title: "F1 더 무비",
        theaters: [
          { name: "1관", times: ["10:00", "13:00", "16:00"] },
          { name: "2관", times: ["11:00", "14:00", "17:00"] },
        ],
      },
      {
        title: "하이재킹",
        theaters: [
          { name: "1관", times: ["09:00", "12:00", "15:00"] },
          { name: "2관", times: ["10:30", "13:30", "16:30"] },
        ],
      },
      {
        title: "범죄도시 4",
        theaters: [{ name: "1관", times: ["09:30", "12:30", "15:30"] }],
      },
      {
        title: "파일럿",
        theaters: [
          { name: "1관", times: ["09:00", "12:00", "15:00"] },
          { name: "2관", times: ["10:30", "13:30", "16:30"] },
        ],
      },
      {
        title: "원더랜드",
        theaters: [{ name: "1관", times: ["09:00", "12:00", "15:00"] }],
      },
    ],
  },
];

export { movie, dates };
