import pic1 from "../image/pic1.jpg";
import pic2 from "../image/pic2.jpg";
import pic3 from "../image/pic3.JPG";

export const movies = [
  {
    id: 1,
    title: "극장판 귀멸의 칼날: 무한성편",
    image: pic1,
    youtubeId: "Rb9jQkFmOuY",
    description: `혈귀로 변해버린 여동생 네즈코를 인간으로 되돌리기 위해 혈귀를 사냥하는 조직인 《귀살대》에 입대한 카마도 탄지로. 입대 후 동료인 아가츠마 젠이츠, 하시비라 이노스케와 함께 많은 혈귀와 싸우고, 성장하면서 세 사람의 우정과 유대는 깊어진다. 탄지로는 《귀살대》 최고위 검사인 《주》와도 함께 싸웠다. 「무한열차」에서는 염주・렌고쿠 쿄쥬로, 「유곽」에서는 음주・우즈이 텐겐, 「도공 마을」에서는 하주・토키토 무이치로, 연주・칸로지 미츠리와 함께 혈귀를 상대로 격렬한 전투를 벌였다. 그 후 다가올 혈귀와의 결전에 대비해 귀살대원들과 함께 《주》가 주도하는 합동 강화 훈련에 참가해 훈련을 받던 도중《귀살대》의 본부인 우부야시키 저택에 나타난 키부츠지 무잔. 어르신의 위기에 달려온 《주》들과 탄지로였지만, 무잔의 술수로 의문의 공간으로 떨어지고 말았는데. 탄지로 일행이 떨어진 곳, 그곳은 혈귀의 본거지 《무한성》─ “귀살대”와 “혈귀”의 최종 결전의 포문이 열린다.`,
  },
  {
    id: 2,
    title: "좀비딸",
    image: pic2,
    youtubeId: "0uZ7l2fCwEg",
    description: `"나의 딸은 좀비다. 이 세상 마지막 남은 유일한 좀비" 댄스 열정을 불태우는 사춘기 딸 ‘수아’와 함께 티격태격 일상을 보내는 맹수 전문 사육사 ‘정환’. 어느 날 전 세계를 강타한 좀비 바이러스에 감염된 딸 ’수아’를 지키기 위해 ’정환’은 어머니 ’밤순’이 사는 바닷가 마을 ’은봉리’로 ‘수아’와 함께 향한다. 감염자를 색출해 내려는 사회 분위기 속에서 ’수아’가 어렴풋이 사람 말을 알아듣고, 평소 좋아하던 춤과 할머니 ‘밤순’의 따끔한 효자손 맛에 반응하는 모습을 발견한다. 절대 ’수아’를 포기할 수 없는 ’정환’은 호랑이 사육사의 오랜 경험을 살려 좀비딸 트레이닝에 돌입하는데... 맹수보다 사납고, 사춘기보다 예민한 좀비딸 훈련기! 올여름, 가장 유쾌한 극비 프로젝트가 시작된다!`,
  },
  {
    id: 3,
    title: "F1: 더 무비",
    image: pic3,
    youtubeId: "8yh9BPUBbbQ",
    description: `한때 주목받는 유망주였지만 끔찍한 사고로 F1®에서 우승하지 못하고 한순간에 추락한 드라이버 '소니 헤이스'(브래드 피트). 그의 오랜 동료인 '루벤 세르반테스'(하비에르 바르뎀)에게 레이싱 복귀를 제안받으며 최하위 팀인 APXGP에 합류한다. <br /><br />그러나 팀 내 떠오르는 천재 드라이버 '조슈아 피어스'(댐슨 이드리스)와 '소니 헤이스'의 갈등은 날이 갈수록 심해지고. 설상가상 우승을 향한 APXGP 팀의 전략 또한 번번이 실패하며 최하위권을 벗어나지 못하고 고전하는데··· <br /><br />빨간 불이 꺼지고 운명을 건 레이스가 시작된다!`,
  },
];